Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.DisconnectFromServer
Sets the GUID of the API server to invalid value and removes all the server related data from the Rebar (ex. the current constraints and the handle tags are removed).
Calling this method will result in a Rebar that will not react to host changes anymore, however it will still have all the properties that it used to have.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetServerGUID
Returns the GUID of the API server.
Returns:
The GUID of the API server
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetCurves(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Set the curves into a free form Rebar.  Will throw exception if the rebar has valid constraints.
Remarks:
This function can fail due to following reasons:
The array of CurveLoops is empty.
At least one CurveLoop is empty.
At least one CurveLoop contains an unbounded curve.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Each curve loop represents a bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetCurves(System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.Curve}})
Set the curves into a free form Rebar.  Will throw exception if the rebar has valid constraints.
Remarks:
This function can fail due to following reasons:
One or more of the input curves was null.
One or more of the input curves was unbounded.
Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Each array of curves represent a bar in the set.
Returns:
Returns Success(0) if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.CanBeHookNormal(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
A vector can be hook normal if for a bar specified by index, the bar direction is not parallel with the vector.
barIndex:
The index of bar for which it will try to see if hook normal is applicable.
end:
The end of bar. Should be 0 for start, 1 for end.
normal:
The hook plane normal that will be tested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetHookOrientationAngle(System.Int32)
Get the hook orientation angle at end.
end:
The end of bar. Should be 0 for start or 1 for end.
Returns:
The hook orientation angle at end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetHookOrientationAngle(System.Int32,System.Double)
Set the hook orientation angle at end. Will throw exception if the rebar has valid constraints.
end:
The end of bar. Should be 0 for start or 1 for end.
angle:
The hook orientation angle at end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetHookPlaneNormalForBarIdx(System.Int32,System.Int32)
Returns the normal of plane in which the hook at end of bar with index barPositionIndex will stay.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
The normal of plane in which the hook at end of bar with index barPositionIndex will stay.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetHookPlaneNormalForBarIdx(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. Will throw exception if the rebar has valid constraints.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
hookNormal:
The normal of plane in which the hook at end of bar with index barPositionIndex will stay.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Normal hookNormal for end end isn't a valid normal for bar with index barPositionIndex
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
-or-
hookNormal has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.IsUnconstrained
Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints.
Returns:
Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints.
Returns false if the current rebar contains a valid server GUID and has valid constraints.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.HasValidServer
Returns true if the current rebar contains a valid server GUID, false otherwise.
Returns:
Returns true if the current rebar contains a valid server GUID, false otherwise.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetEndTreatmentTypeIdAtIndex(System.Int32,System.Int32)
Gets the id of the EndTreatmentType that is applied to the bar with index barPositionIndex at the specified end.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetEndTreatmentTypeId(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetEndTreatmentTypeId(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetEndTreatmentTypeId(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the id of the EndTreatmentType at the opposite end. For the others bars will return the same as Rebar.GetEndTreatmentTypeId(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start hook, 1 for the end hook.
Returns:
Returns the the id of the EndTreatmentType at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetCouplerIdAtIndex(System.Int32,System.Int32)
Gets the id of the Rebar Coupler that is applied to the bar with index barPositionIndex at the specified end.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetCouplerId(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetCouplerId(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetCouplerId(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the id of the Rebar Coupler at the opposite end. For the others bars will return the same as Rebar.GetCouplerId(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start hook, 1 for the end hook.
Returns:
Returns id of the Rebar Coupler at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetHookOrientationAtIndex(System.Int32,System.Int32)
Gets the hook orientation that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetHookOrientation(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetHookOrientation(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetHookOrientation(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the hook orientation at the opposite end. For the others bars will return the same as Rebar.GetHookOrientation(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start hook, 1 for the end hook.
Returns:
Returns the hook orientation at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetHookOrientationAngleAtIndex(System.Int32,System.Int32)
Gets the hook orientation angle that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as RebarFreeFormAccessor.GetHookOrientationAngle(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as RebarFreeFormAccessor.GetHookOrientationAngle(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as RebarFreeFormAccessor.GetHookOrientationAngle(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the hook orientation angle at the opposite end. For the others bars will return the same as RebarFreeFormAccessor.GetHookOrientationAngle(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start hook, 1 for the end hook.
Returns:
Returns the hook orientation angle at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetHookTypeIdAtIndex(System.Int32,System.Int32)
Gets the id of the RebarHookType that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetHookTypeId(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetHookTypeId(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetHookTypeId(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the id of the RebarHookType at the opposite end. For the others bars will return the same as Rebar.GetHookTypeId(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start hook, 1 for the end hook.
Returns:
The id of a RebarHookType, or invalidElementId if the rebar has no hook at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.IsBarMatchedWithShapeInReverseOrder(System.Int32)
Checks if the bar at index barPositionIndex it's matched in reversed order with its shape.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return false for all barPositionIndex between 0 and (NumberOfBarPositions-1).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return false for all barPositionIndex between 0 and (NumberOfBarPositions-1).All bars are matched in reversed order with a shape. In this case the Rebar will be reversed and will return false for all barPositionIndex between 0 and (NumberOfBarPositions-1).Some bars are matched in reversed order and the others are matched exactly with a shape. For the bars matched in reversed order will return true and for the others will return false
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
Returns true if the bar is matched in reversed order with its shape, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetShapeIdAtIndex(System.Int32)
Gets the Rebar Shape id for the bar with index barPositionIndex.
Remarks:
If this function is called for the first bar or last bar in set and this is hidden, this function will throw exception.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
Gets the ElementId of the Rebar Shape for the bar with index barPositionIndex.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
barPositionIndex is an index for the first or last bar which is hidden.
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsMinimumClearSpacing(System.Double)
Sets the Layout Rule property of rebar set to Minimum Clear Spacing.
spacing:
The maximum spacing of bars in set.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsMaximumSpacing(System.Double)
Sets the Layout Rule property of rebar set to Maximum Spacing.
spacing:
The maximum spacing of bars in set.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsFixedNumber(System.Int32)
Sets the Layout Rule property of rebar set to Fixed Number.
numberOfBars:
The number of bars in set.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsNumberWithSpacing(System.Int32,System.Double)
Sets the Layout Rule property of rebar set to Number With Spacing.
numberOfBars:
The number of bars in set.
spacing:
The spacing of bars in set.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsSingle
Sets the Layout Rule property of rebar set to Single.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetCustomDistributionPath
Gets the custom distribution path for free form rebar set.
Remarks:
For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars.
The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
Returns:
Returns an array of curves that represent the distribution path.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.WorkshopInstructions
Identifies the workshop instructions of the current Rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor
A class that is used to access the properties and capabilities of free-form Rebar.
Remarks:
Obtain an instance of this class from Autodesk.Revit.DB.Structure.Rebar.GetFreeFormAccessor.
The accessor includes a reference to the Rebar element.
If the referenced Rebar element is deleted, using the methods form this class will throw exception.
Since:
2018